renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
/******************************************************************************
Function Name   : usb_cstd_dma_set_ch_no
Description     : Set DMA channel no.
Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure
                : uint16_t useport  : FIFO select
                : uint8_t dma_ch_no : DMA channel no.
Return value    : none
******************************************************************************/
void        usb_cstd_dma_set_ch_no(uint16_t ip_no, uint16_t use_port, uint8_t dma_ch_no)
{
    g_usb_cstd_dma_ch[ip_no][use_port] = dma_ch_no;  /* DMA ch no. table */
}
/******************************************************************************
End of function usb_cstd_dma_set_ch_no
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_dma_ref_ch_no
Description     : Get DMA channel no.
Arguments       : usb_utr_t *ptr    : Pointer to usb_utr_t structure
                : uint16_t  useport : FIFO select
Return value    : DMA channel no.
******************************************************************************/
uint8_t     usb_cstd_dma_ref_ch_no(uint16_t ip_no, uint16_t use_port)
{
    return g_usb_cstd_dma_ch[ip_no][use_port];  /* DMA ch no. table */
}
/******************************************************************************
End of function usb_cstd_dma_ref_ch_no
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_dma_send_complete
Description     : Set event for DMA transfer complete of Buffer to DxFIFO.
Arguments       : uint16_t ip_no  : IP no.(USB_IP0/USB_IP1)
                : uint16_t useport: FIFO select(USB_D0USE/USB_D1USE)
Return value    : none
******************************************************************************/
void usb_cstd_dma_send_complete(uint16_t ip_no, uint16_t use_port)
{
#if (BSP_CFG_RTOS_USED == 1)

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
    usb_utr_t   *p_host;
    usb_utr_t   utr;
#endif
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
    usb_utr_t   *p_peri;
#endif

    if (USB_HOST == g_usb_usbmode)
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        usb_cstd_dma_stop(ip_no, use_port);     /* Stop DMA,FIFO access */

        utr.ip = ip_no;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

        hw_usb_clear_dreqe(&utr, use_port);     /* DMA Transfer request disable */

        p_host          = (usb_utr_t *)get_usb_int_buf();
        p_host->ip      = ip_no;
        p_host->msginfo = USB_MSG_HCD_INT;
        p_host->keyword = USB_INT_DXFIFO;
        p_host->status  = use_port;

        p_host->ipp     = utr.ipp;
        USB_ISND_MSG(USB_HCD_MBX, (usb_msg_t *)p_host);
#endif  /* ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST) */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        usb_cstd_dma_stop(USB_CFG_USE_USBIP, use_port); /* Stop DMA,FIFO access */
        hw_usb_clear_dreqe(USB_NULL, use_port);         /* DMA Transfer request disable */

        p_peri              = (usb_utr_t *)get_usb_int_buf();
        p_peri->ip          = ip_no;
        p_peri->msginfo     = USB_MSG_PCD_INT;
        p_peri->keyword     = USB_INT_DXFIFO;
        p_peri->status      = use_port;

        USB_ISND_MSG(USB_PCD_MBX, (usb_msg_t *)p_peri);
#endif  /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */
    }


#else   /* (BSP_CFG_RTOS_USED == 1) */

#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
    usb_utr_t   utr;
#endif  /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */

    gs_usb_cstd_dma_int.buf[gs_usb_cstd_dma_int.wp].ip = ip_no;
    gs_usb_cstd_dma_int.buf[gs_usb_cstd_dma_int.wp].fifo_type = use_port;
    gs_usb_cstd_dma_int.wp = ((gs_usb_cstd_dma_int.wp+1) % USB_INT_BUFSIZE);

    if (USB_HOST == g_usb_usbmode)
    {
#if ((USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST)
        usb_cstd_dma_stop(ip_no, use_port);     /* Stop DMA,FIFO access */

        utr.ip = ip_no;
        utr.ipp = usb_hstd_get_usb_ip_adr(utr.ip);

        hw_usb_clear_dreqe(&utr, use_port);       /* DMA Transfer request disable */

#endif  /* ( (USB_CFG_MODE & USB_CFG_HOST) == USB_CFG_HOST ) */
    }
    else
    {
#if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        usb_cstd_dma_stop(USB_CFG_USE_USBIP, use_port); /* Stop DMA,FIFO access */
        hw_usb_clear_dreqe(USB_NULL, use_port);         /* DMA Transfer request disable */

#endif  /* ( (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI ) */
    }
#endif  /* (BSP_CFG_RTOS_USED == 1) */
}
/******************************************************************************
End of function usb_cstd_dma_send_complete
******************************************************************************/

/*******************************************************************************
* Function Name: usb_cstd_ip0_d0fifo_cb
* Description  : Interrupt service routine of D0FIFO
* Arguments    : none
* Return Value : none
*******************************************************************************/
void usb_cstd_ip0_d0fifo_cb (void)
{
    usb_cstd_dma_send_complete(USB_IP0, USB_D0USE);
}
/******************************************************************************
End of function usb_cstd_ip0_d0fifo_cb
******************************************************************************/

/*******************************************************************************
* Function Name: usb_cstd_ip0_d1fifo_cb
* Description  : Interrupt service routine of D1FIFO
* Arguments    : none
* Return Value : none
*******************************************************************************/
void usb_cstd_ip0_d1fifo_cb (void)
{
    usb_cstd_dma_send_complete(USB_IP0, USB_D1USE);
}
/******************************************************************************
End of function usb_cstd_ip1_d0fifo_cb
******************************************************************************/

