renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
/******************************************************************************
Function Name   : usb_cstd_dma_send_setting
Description     : Buffer to FIFO data write DMA start
Arguments       : usb_utr_t *ptr            : Pointer to usb_utr_t structure
                : uint32_t  src_adr         : Source address
                : uint16_t  useport         : FIFO Access mode
                : uint32_t  transfer_size   : Transfer size
Return value    : none
******************************************************************************/
void usb_cstd_dma_send_setting(usb_utr_t *ptr, uint32_t src_adr, uint16_t useport, uint32_t transfer_size)
{
    dtc_transfer_data_cfg_t     td_cfg;
    dtc_stat_t                  dmac_status;
    dtc_cmd_arg_t               args;
    uint16_t                    bit_width;
    uint8_t                     dma_ch;
    uint16_t                    vect;
    uint16_t                    ip;
    uint16_t                    block_size;
    uint16_t                    active_cnt;

    /* DTC Transfer enable
    b0    DTCST    DTC module start bit
    b7-b1 Reserved 0
    */
    R_DTC_Control( DTC_CMD_DTC_START, USB_NULL, 0 );

    /* DTC control register (Transfer Information Read No Skip)
    b2-b0 Reserved 0
    b3    Reserved 0
    b4    RRS      DTC Transfer Information Read Skip enable bit
    b7-b5 Reserved 0
    */
    R_DTC_Control( DTC_CMD_DATA_READ_SKIP_DISABLE, USB_NULL, 0 );

    /* DTC control register (Transfer Information Read No Skip)
    b2-b0 Reserved 0
    b3    Reserved 0
    b4    RRS      DTC Transfer Information Read Skip enable bit
    b7-b5 Reserved 0
    */
    R_DTC_Control(DTC_CMD_DATA_READ_SKIP_ENABLE, USB_NULL, 0);

    if (USB_NULL != ptr)
    {
        ip = ptr->ip;
    }
    else
    {
  #if USB_CFG_USE_USBIP == USB_CFG_IP0
        /* USB0 */
        ip = USB_IP0;

  #else     /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
        /* USB1/USBA */
        ip = USB_IP1;

  #endif    /* USB_CFG_USE_USBIP == USB_CFG_IP0 */
    }

    dma_ch = usb_cstd_dma_ref_ch_no(ip, useport);

    if (g_usb_cstd_dma_fifo[ip][dma_ch] > transfer_size)
    {
        block_size       = transfer_size;
    }
    else
    {
        block_size       = g_usb_cstd_dma_fifo[ip][dma_ch];
    }

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    if ((0 == (transfer_size & 0x03)) && (USB_IP1 == ip))
    {
        block_size       = ((block_size -1) /4) +1;
        bit_width        = USB_FIFO_ACCESS_TYPE_32BIT;
        td_cfg.data_size = DTC_DATA_SIZE_LWORD;
    }
    else
    {

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
        block_size       = ((block_size -1) /2) +1;
        bit_width        = USB_FIFO_ACCESS_TYPE_16BIT;
        td_cfg.data_size = DTC_DATA_SIZE_WORD;
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    }

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

    vect = usb_cstd_dma_get_ir_vect(ptr, useport);

    active_cnt = 0;
    /* Wait for Complete of DMA transfer. */
    /* WAIT_LOOP */
    do
    {
        R_DTC_Control(DTC_CMD_STATUS_GET, &dmac_status, &args);
        if(true == dmac_status.in_progress)
        {
            active_cnt = 0;
        }
        else
        {
            active_cnt ++;
        }
    }
    while(active_cnt < ACTIVE_CNT_NUMBER);

/* DMA test code start */
    /* Operation - No Extended Repeat Area Function and No Offset Subtraction */
    /* Source address is fixed
    * Transfer data size is 32-bit (long word).
    * DMAC transfer mode is Repeat mode & Source side is repeat area
    * At the beginning of transfer, clear the interrupt flag of the activation source
    to 0.
    * Transfer Request source is software. */
    /* Set Transfer data configuration. */
    td_cfg.transfer_mode        = DTC_TRANSFER_MODE_BLOCK;
    td_cfg.repeat_block_side    = DTC_REPEAT_BLOCK_DESTINATION;
    td_cfg.src_addr_mode        = DTC_SRC_ADDR_INCR;
    td_cfg.dest_addr_mode       = DTC_DES_ADDR_FIXED;
    td_cfg.source_addr          = src_adr;
    td_cfg.dest_addr            = hw_usb_get_dxfifo_adr(ptr, useport, bit_width);
    td_cfg.transfer_count       = ((transfer_size -1) / g_usb_cstd_dma_fifo[ip][dma_ch]) +1;
    td_cfg.block_size           = block_size;
    td_cfg.chain_transfer_enable = DTC_CHAIN_TRANSFER_DISABLE;
    td_cfg.chain_transfer_mode  = DTC_CHAIN_TRANSFER_CONTINUOUSLY;
    td_cfg.response_interrupt   = DTC_INTERRUPT_AFTER_ALL_COMPLETE;
#if defined(BSP_MCU_RX65N)
    td_cfg.writeback_disable = DTC_WRITEBACK_ENABLE;     /* Write-back disable or enable */
    td_cfg.sequence_end = DTC_SEQUENCE_TRANSFER_CONTINUE;          /* Sequence transfer end or continue */
    td_cfg.refer_index_table_enable = DTC_REFER_INDEX_TABLE_DISABLE; /* Index table refer or not refer */
    td_cfg.disp_add_enable = DTC_SRC_ADDR_DISP_ADD_DISABLE;       /* The displacement value is added or not added */
#endif /* defined(BSP_MCU_RX65N) */

    /* Call R_DTC_Create(). */
    R_DTC_Create((dtc_activation_source_t)vect, &g_usb_dtc_transfer_data[dma_ch], &td_cfg, 0);

    if (USB_IP0 == ip)
    {
        if (USB_D0USE == useport)
        {
            /* DTC start enable register (USB0 D0FIFO transfer enable)
            b0    DTCE     DTC start enable bit
            b7-b1 Reserved 0
            */
            DTCE (USB0, D0FIFO0) = 1;
            IPR (USB0, D0FIFO0) = 4u;                   /* D0FIFO0 Enable */
        }
        else
        {
            /* DTC start enable register (USBA D0FIFO transfer enable)
            b0    DTCE     DTC start enable bit
            b7-b1 Reserved 0
            */
            DTCE (USB0, D1FIFO0) = 1;
            IPR (USB0, D1FIFO0) = 4u;                   /* D0FIFO0 Enable */
        }
    }
    else
    {
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        if (USB_D0USE == useport)
        {
            /* DTC start enable register (USBA D0FIFO transfer enable)
            b0    DTCE     DTC start enable bit
            b7-b1 Reserved 0
            */
            DTCE (USBA, D0FIFO2) = 1;
            IPR (USBA, D0FIFO2) = 4u;                   /* D0FIFO0 Enable */
        }
        else
        {
            /* DTC start enable register (USBA D0FIFO transfer enable)
            b0    DTCE     DTC start enable bit
            b7-b1 Reserved 0
            */
            DTCE (USBA, D1FIFO2) = 1;
            IPR (USBA, D1FIFO2) = 4u;                   /* D0FIFO0 Enable */
        }
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined(BSP_MCU_RX63N)
        if (USB_D0USE == useport)
        {
            /* DTC start enable register (USBA D0FIFO transfer enable)
            b0    DTCE     DTC start enable bit
            b7-b1 Reserved 0
            */
            DTCE (USB1, D0FIFO1) = 1;
            IPR (USB1, D0FIFO1) = 4u;                   /* D0FIFO0 Enable */
        }
        else
        {
            /* DTC start enable register (USBA D0FIFO transfer enable)
            b0    DTCE     DTC start enable bit
            b7-b1 Reserved 0
            */
            DTCE (USB1, D1FIFO1) = 1;
            IPR (USB1, D1FIFO1) = 4u;                   /* D0FIFO0 Enable */
        }
#endif  /* defined(BSP_MCU_RX63N) */
    }
}
/******************************************************************************
End of function usb_cstd_dma_send_setting
******************************************************************************/

