renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/hw/r_usb_dma.c
/******************************************************************************
Function Name   : usb_cstd_dma_stop
Description     : DMA stop
Arguments       : uint8_t   ip_type     : USB_IP0/USB_IP1
                : uint16_t  use_port    : FIFO select
Return value    : void
******************************************************************************/
void usb_cstd_dma_stop(uint8_t ip_type, uint16_t use_port)
{
    uint16_t    active_cnt;
    dtc_stat_t      stat;
    dtc_cmd_arg_t   args;
    usb_utr_t       utr;

    active_cnt = 0;
    /* Wait for Complete of DTC transfer. */
    /* WAIT_LOOP */
    do
    {
        R_DTC_Control(DTC_CMD_STATUS_GET, &stat, &args);
        if(true == stat.in_progress)
        {
            active_cnt = 0;
        }
        else
        {
            active_cnt ++;
        }
    }
    while(active_cnt < ACTIVE_CNT_NUMBER);

    if (USB_IP0 == ip_type)
    {
        /* DTC start enable register (USB0 D0FIFO transfer disable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
        if (USB_D0USE == use_port)
        {
            DTCE (USB0, D0FIFO0) = 0;
            IPR (USB0, D0FIFO0) = 0u;                   /* D0FIFO0 Disable */
        }
        else
        {
            DTCE (USB0, D1FIFO0) = 0;
            IPR (USB0, D1FIFO0) = 0u;                   /* D0FIFO0 Disable */
        }
    }
    else
    {
        /* DTC start enable register (USBA D0FIFO transfer disable)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        if (USB_D0USE == use_port)
        {
            DTCE (USBA, D0FIFO2) = 0;
            IPR (USBA, D0FIFO2) = 0u;                   /* D0FIFO0 Disable */
        }
        else
        {
            DTCE (USBA, D1FIFO2) = 0;
            IPR (USBA, D1FIFO2) = 0u;                   /* D0FIFO0 Disable */
        }
#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined(BSP_MCU_RX63N)
        if (USB_D0USE == use_port)
        {
            DTCE (USB1, D0FIFO1) = 0;
            IPR (USB1, D0FIFO1) = 0u;                   /* D0FIFO0 Disable */
        }
        else
        {
            DTCE (USB1, D1FIFO1) = 0;
            IPR (USB1, D1FIFO1) = 0u;                   /* D0FIFO0 Disable */
        }
#endif  /* defined(BSP_MCU_RX63N) */
    }

    utr.ip = ip_type;
    usb_cstd_dma_clear_ir(&utr, use_port);
}
/******************************************************************************
End of function usb_cstd_dma_stop
******************************************************************************/

/******************************************************************************
Function Name   : usb_cstd_dma_get_crtb
Description     : Get DMA Current Transaction Byte reg B(CRTB).
Arguments       : uint16_t dma_ch : DMA Channel no.
Return value    : DMA Current Transaction Byte reg B(CRTB)
******************************************************************************/
uint16_t usb_cstd_dma_get_crtb(uint16_t dma_ch)
{
    uint16_t value;
    dtc_stat_t      dmac_status;
    dtc_cmd_arg_t   args;

    /* Wait Complete DTC Transfer */
    /* WAIT_LOOP */
    do
    {
        R_DTC_Control(DTC_CMD_STATUS_GET, &dmac_status, &args);
    }
    while (true == dmac_status.in_progress);  /* DTC is not active */

    /* Read DTC transfer count (CRB) */
    value = (uint16_t)(g_usb_dtc_transfer_data[dma_ch].lw4 & 0xffff);

    return value;
}
/******************************************************************************
End of function usb_cstd_dma_get_crtb
******************************************************************************/
#endif /* USB_CFG_DTC == USB_CFG_ENABLE */

#endif  /* ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE)) */

/******************************************************************************
End of file
******************************************************************************/
